БИТУправление_медицинским_центром_демо/src/InformationRegisters/ОбязательныеРеквизитыОбъектов/ОбязательныеРеквизитыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбязательныеРеквизитыОбъектов</name>
  <comment>Обязательные (при интерактивном вводе элемента) поля</comment>
  <resources>
    <name>ТолькоПриЗаписиНового</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИмяСправочника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметПроверки</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>Skype</name>
      <description>Skype</description>
    </items>
    <items>
      <name>АдресИностранный</name>
      <description>Адрес за пределами РФ</description>
    </items>
    <items>
      <name>АдресМестаРождения</name>
      <description>Адрес места рождения</description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыДомашний</name>
      <description>Адрес электронной почты (личный)</description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыРабочий</name>
      <description>Адрес электронной почты (рабочий)</description>
    </items>
    <items>
      <name>ВебСтраницаОрганизации</name>
      <description>Веб-страница организации</description>
    </items>
    <items>
      <name>ТелефонДомашний</name>
      <description>Домашний телефон</description>
    </items>
    <items>
      <name>ВебСтраницаФизЛица</name>
      <description>Домашняя веб-страница</description>
    </items>
    <items>
      <name>НомерПрочий</name>
      <description>Номер прочий</description>
    </items>
    <items>
      <name>АдресПочтовый</name>
      <description>Почтовый адрес</description>
    </items>
    <items>
      <name>ПрочаяИнформация</name>
      <description>Прочая информация</description>
    </items>
    <items>
      <name>ТелефонРабочий</name>
      <description>Рабочий телефон</description>
    </items>
    <items>
      <name>ТелефонСотовый</name>
      <description>Сотовый телефон</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>Телефон контрагента</description>
    </items>
    <items>
      <name>ТелефонОрганизации</name>
      <description>Телефон организации</description>
    </items>
    <items>
      <name>Факс</name>
      <description>Факс</description>
    </items>
    <items>
      <name>АдресФактический</name>
      <description>Фактический адрес</description>
    </items>
    <items>
      <name>АдресЮридический</name>
      <description>Юридический адрес (адрес регистрации)</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <comment>Тип контактной информации</comment>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМаскуВвода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаВводаТелефонногоНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <comment>Не используется</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеТолькоВДиалоге</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <comment>Не используется</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактируетсяВФормеОбъекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ОбязательныеРеквизитыОбъектов/Forms/ДобавлениеСтандартныхОбязательныхРеквизитов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбязательныеРеквизиты = РегистрыСведений.ОбязательныеРеквизитыОбъектов;
	
	МассивСтандартныхРеквизитов = ОбязательныеРеквизиты.ПолучитьСтандартныеРеквизиты();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбязательныеРеквизитыОбъектов.ИмяСправочника КАК ИмяСправочника,
	               |	ОбязательныеРеквизитыОбъектов.ИмяРеквизита КАК ИмяРеквизита,
	               |	ОбязательныеРеквизитыОбъектов.ТолькоПриЗаписиНового КАК ТолькоПриЗаписиНового
	               |ИЗ
	               |	РегистрСведений.ОбязательныеРеквизитыОбъектов КАК ОбязательныеРеквизитыОбъектов";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Реквизит Из МассивСтандартныхРеквизитов Цикл
		
		Если РезультатЗапроса.НайтиСтроки(Новый Структура("ИмяСправочника, ИмяРеквизита", Реквизит.ИмяСправочника, Реквизит.ИмяРеквизита)).Количество() = 0 Тогда
			
			НоваяСтрока = СтандартныеРеквизиты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизит);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СтандартныеРеквизиты.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Все стандартные записи регистра уже созданы!");
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	
	БылаЗапись = Ложь;
	ДобавитьНаСервере(БылаЗапись);		
	Если БылаЗапись Тогда
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ОбязательныеРеквизитыОбъектов"));	
	КонецЕсли;
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ЭтаФорма.Закрыть();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	ПроставитьФлажки();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	ПроставитьФлажки(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаСервере
Процедура ДобавитьНаСервере(БылаЗапись)
		
	Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
		
		Если Реквизит.Добавить Тогда
			Запись = РегистрыСведений.ОбязательныеРеквизитыОбъектов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Реквизит);
			Запись.Записать();
			БылаЗапись = Истина;
			
			ВидКИ = ПолучитьВидКИ(Реквизит);
			
			Если ВидКИ <> Неопределено Тогда
				Попытка
					ВидКИОбъект = ВидКИ.ПолучитьОбъект();
					Если Не ВидКИОбъект.РедактируетсяВФормеОбъекта Тогда
						ВидКИОбъект.РедактируетсяВФормеОбъекта = Истина;
						ВидКИОбъект.Записать();
					КонецЕсли;
				Исключение КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидКИ(Реквизит)

	ПрефиксКИ = РегистрыСведений.ОбязательныеРеквизитыОбъектов.ПрефиксРеквизитовВидовКИ();
	Если СтрНайти(Реквизит.ИмяРеквизита, ПрефиксКИ) <> 0 Тогда
		Имя = Прав(Реквизит.ИмяРеквизита, СтрДлина(Реквизит.ИмяРеквизита) - СтрДлина(ПрефиксКИ));
		Попытка
			Возврат Справочники.ВидыКонтактнойИнформации[Имя];	
		Исключение
			Попытка
				УИД = СтрЗаменить(Имя, "_", "-");
			  	Ссылка = Справочники.ВидыКонтактнойИнформации.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
				Возврат Ссылка; 
			Исключение
				Возврат Неопределено;	
			КонецПопытки;
		КонецПопытки;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПроставитьФлажки(Значение = Истина)
	
	Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
		Реквизит.Добавить = Значение;	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
